{"class_name": "Model", "keras_version": "1.0.8", "config": {"layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "words1", "input_dtype": "int32"}, "inbound_nodes": [], "name": "words1"}, {"class_name": "InputLayer", "config": {"batch_input_shape": [null, 100], "name": "words2", "input_dtype": "int32"}, "inbound_nodes": [], "name": "words2"}, {"class_name": "Embedding", "config": {"trainable": false, "name": "embed", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 1297638, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.0, "output_dim": 300, "input_length": 100}, "inbound_nodes": [[["words1", 0, 0]], [["words2", 0, 0]]], "name": "embed"}, {"class_name": "Lambda", "config": {"function": ["c\u0001\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0003\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u0010\u0000\u0000\u0000|\u0000\u0000\u0088\u0000\u0000d\u0001\u0000\u0018\u0016d\u0001\u0000\u0017S(\u0002\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000(\u0000\u0000\u0000\u0000(\u0001\u0000\u0000\u0000t\u0004\u0000\u0000\u0000sent(\u0001\u0000\u0000\u0000t\u0007\u0000\u0000\u0000nr_tune(\u0000\u0000\u0000\u0000s7\u0000\u0000\u0000keras_parikh_entailment/keras_decomposable_attention.pyt\b\u0000\u0000\u0000<lambda>W\u0000\u0000\u0000t\u0000\u0000\u0000\u0000", null, [5000]], "name": "lambda_1", "trainable": true, "function_type": "lambda", "arguments": {}, "output_shape": [100], "output_shape_type": "raw"}, "inbound_nodes": [[["words1", 0, 0]], [["words2", 0, 0]]], "name": "lambda_1"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "project", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "bias": false, "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "linear", "output_dim": 100}}, "trainable": true, "name": "timedistributed_1"}, "inbound_nodes": [[["embed", 0, 0]], [["embed", 1, 0]]], "name": "timedistributed_1"}, {"class_name": "Embedding", "config": {"trainable": true, "name": "tune", "activity_regularizer": null, "W_constraint": null, "init": "uniform", "input_dtype": "int32", "mask_zero": false, "input_dim": 5000, "batch_input_shape": [null, 100], "W_regularizer": null, "dropout": 0.2, "output_dim": 100, "input_length": 100}, "inbound_nodes": [[["lambda_1", 0, 0]], [["lambda_1", 1, 0]]], "name": "tune"}, {"class_name": "Merge", "config": {"name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributed_1", 0, 0], ["tune", 0, 0]]], "name": "merge_1"}, {"class_name": "Merge", "config": {"name": "merge_2", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributed_1", 1, 0], ["tune", 1, 0]]], "name": "merge_2"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 100], "trainable": true, "name": "dropout_1", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "attend1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "activation": "relu", "input_dtype": "float32", "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "output_dim": 100, "batch_input_shape": [null, 100]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_2"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "attend2", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "relu", "output_dim": 100}}]}, "trainable": true, "name": "timedistributed_2"}, "inbound_nodes": [[["merge_1", 0, 0]], [["merge_2", 0, 0]]], "name": "timedistributed_2"}, {"class_name": "Merge", "config": {"name": "merge_3", "concat_axis": -1, "mode_type": "lambda", "dot_axes": -1, "mode": ["c\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000\u0007\u0000\u0000\u0000S\u0000\u0000\u0000s6\u0000\u0000\u0000t\u0000\u0000j\u0001\u0000|\u0000\u0000d\u0001\u0000\u0019t\u0000\u0000j\u0002\u0000|\u0000\u0000d\u0002\u0000\u0019d\u0004\u0000\u0083\u0002\u0000\u0083\u0002\u0000}\u0001\u0000t\u0000\u0000j\u0002\u0000|\u0001\u0000d\u0005\u0000\u0083\u0002\u0000S(\u0006\u0000\u0000\u0000Ni\u0001\u0000\u0000\u0000i\u0000\u0000\u0000\u0000i\u0002\u0000\u0000\u0000(\u0003\u0000\u0000\u0000i\u0000\u0000\u0000\u0000i\u0002\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0003\u0000\u0000\u0000i\u0000\u0000\u0000\u0000i\u0002\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0003\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\t\u0000\u0000\u0000batch_dott\u0012\u0000\u0000\u0000permute_dimensions(\u0002\u0000\u0000\u0000t\u0002\u0000\u0000\u0000ABt\u0006\u0000\u0000\u0000att_ji(\u0000\u0000\u0000\u0000(\u0000\u0000\u0000\u0000s7\u0000\u0000\u0000keras_parikh_entailment/keras_decomposable_attention.pyt\u0006\u0000\u0000\u0000_outer\u008b\u0000\u0000\u0000s\u0004\u0000\u0000\u0000\u0000\u0001&\u0001", null, null], "output_shape": [100, 100], "output_shape_type": "raw"}, "inbound_nodes": [[["timedistributed_2", 0, 0], ["timedistributed_2", 1, 0]]], "name": "merge_3"}, {"class_name": "Merge", "config": {"name": "merge_4", "concat_axis": -1, "mode_type": "lambda", "dot_axes": -1, "mode": ["c\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000\b\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u008c\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019}\u0001\u0000|\u0000\u0000d\u0002\u0000\u0019}\u0002\u0000\u0088\u0000\u0000r/\u0000t\u0000\u0000j\u0001\u0000|\u0001\u0000d\u0007\u0000\u0083\u0002\u0000}\u0001\u0000n\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000t\u0004\u0000\u0083\u0001\u0002\u0018\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000t\u0004\u0000\u0083\u0001\u0002}\u0004\u0000|\u0003\u0000|\u0004\u0000\u0015}\u0005\u0000t\u0000\u0000j\u0006\u0000|\u0005\u0000|\u0002\u0000\u0083\u0002\u0000S(\b\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000i\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u00ff\u00ff\u00ff\u00fft\b\u0000\u0000\u0000keepdims(\u0003\u0000\u0000\u0000i\u0000\u0000\u0000\u0000i\u0002\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0007\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0012\u0000\u0000\u0000permute_dimensionst\u0003\u0000\u0000\u0000expt\u0003\u0000\u0000\u0000maxt\u0004\u0000\u0000\u0000Truet\u0003\u0000\u0000\u0000sumt\t\u0000\u0000\u0000batch_dot(\u0006\u0000\u0000\u0000t\u0006\u0000\u0000\u0000attmatt\u0003\u0000\u0000\u0000attt\u0003\u0000\u0000\u0000matt\u0001\u0000\u0000\u0000et\u0001\u0000\u0000\u0000st\u0006\u0000\u0000\u0000sm_att(\u0001\u0000\u0000\u0000t\t\u0000\u0000\u0000transpose(\u0000\u0000\u0000\u0000s7\u0000\u0000\u0000keras_parikh_entailment/keras_decomposable_attention.pyt\u0014\u0000\u0000\u0000_normalize_attention\u009a\u0000\u0000\u0000s\u0010\u0000\u0000\u0000\u0000\u0001\n\u0001\n\u0001\u0006\u0001\u0015\u0002(\u0001\u001b\u0001\n\u0001", null, [false]], "output_shape": [100, 100], "output_shape_type": "raw"}, "inbound_nodes": [[["merge_3", 0, 0], ["merge_2", 0, 0]]], "name": "merge_4"}, {"class_name": "Merge", "config": {"name": "merge_5", "concat_axis": -1, "mode_type": "lambda", "dot_axes": -1, "mode": ["c\u0001\u0000\u0000\u0000\u0006\u0000\u0000\u0000\b\u0000\u0000\u0000\u0013\u0000\u0000\u0000s\u008c\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u0019}\u0001\u0000|\u0000\u0000d\u0002\u0000\u0019}\u0002\u0000\u0088\u0000\u0000r/\u0000t\u0000\u0000j\u0001\u0000|\u0001\u0000d\u0007\u0000\u0083\u0002\u0000}\u0001\u0000n\u0000\u0000t\u0000\u0000j\u0002\u0000|\u0001\u0000t\u0000\u0000j\u0003\u0000|\u0001\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000t\u0004\u0000\u0083\u0001\u0002\u0018\u0083\u0001\u0000}\u0003\u0000t\u0000\u0000j\u0005\u0000|\u0003\u0000d\u0004\u0000d\u0005\u0000d\u0006\u0000t\u0004\u0000\u0083\u0001\u0002}\u0004\u0000|\u0003\u0000|\u0004\u0000\u0015}\u0005\u0000t\u0000\u0000j\u0006\u0000|\u0005\u0000|\u0002\u0000\u0083\u0002\u0000S(\b\u0000\u0000\u0000Ni\u0000\u0000\u0000\u0000i\u0001\u0000\u0000\u0000i\u0002\u0000\u0000\u0000t\u0004\u0000\u0000\u0000axisi\u00ff\u00ff\u00ff\u00fft\b\u0000\u0000\u0000keepdims(\u0003\u0000\u0000\u0000i\u0000\u0000\u0000\u0000i\u0002\u0000\u0000\u0000i\u0001\u0000\u0000\u0000(\u0007\u0000\u0000\u0000t\u0001\u0000\u0000\u0000Kt\u0012\u0000\u0000\u0000permute_dimensionst\u0003\u0000\u0000\u0000expt\u0003\u0000\u0000\u0000maxt\u0004\u0000\u0000\u0000Truet\u0003\u0000\u0000\u0000sumt\t\u0000\u0000\u0000batch_dot(\u0006\u0000\u0000\u0000t\u0006\u0000\u0000\u0000attmatt\u0003\u0000\u0000\u0000attt\u0003\u0000\u0000\u0000matt\u0001\u0000\u0000\u0000et\u0001\u0000\u0000\u0000st\u0006\u0000\u0000\u0000sm_att(\u0001\u0000\u0000\u0000t\t\u0000\u0000\u0000transpose(\u0000\u0000\u0000\u0000s7\u0000\u0000\u0000keras_parikh_entailment/keras_decomposable_attention.pyt\u0014\u0000\u0000\u0000_normalize_attention\u009a\u0000\u0000\u0000s\u0010\u0000\u0000\u0000\u0000\u0001\n\u0001\n\u0001\u0006\u0001\u0015\u0002(\u0001\u001b\u0001\n\u0001", null, [true]], "output_shape": [100, 100], "output_shape_type": "raw"}, "inbound_nodes": [[["merge_3", 0, 0], ["merge_1", 0, 0]]], "name": "merge_5"}, {"class_name": "Merge", "config": {"name": "merge_6", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_1", 0, 0], ["merge_4", 0, 0]]], "name": "merge_6"}, {"class_name": "Merge", "config": {"name": "merge_8", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["merge_2", 0, 0], ["merge_5", 0, 0]]], "name": "merge_8"}, {"class_name": "TimeDistributed", "config": {"layer": {"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 200], "trainable": true, "name": "dropout_3", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "compare1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_1"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "compare2", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_2"}}]}, "trainable": true, "name": "timedistributed_3"}, "inbound_nodes": [[["merge_6", 0, 0]], [["merge_8", 0, 0]]], "name": "timedistributed_3"}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "globalaveragepooling1d_1"}, "inbound_nodes": [[["timedistributed_3", 0, 0]]], "name": "globalaveragepooling1d_1"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "globalmaxpooling1d_1"}, "inbound_nodes": [[["timedistributed_3", 0, 0]]], "name": "globalmaxpooling1d_1"}, {"class_name": "GlobalAveragePooling1D", "config": {"trainable": true, "name": "globalaveragepooling1d_2"}, "inbound_nodes": [[["timedistributed_3", 1, 0]]], "name": "globalaveragepooling1d_2"}, {"class_name": "GlobalMaxPooling1D", "config": {"trainable": true, "name": "globalmaxpooling1d_2"}, "inbound_nodes": [[["timedistributed_3", 1, 0]]], "name": "globalmaxpooling1d_2"}, {"class_name": "Merge", "config": {"name": "merge_7", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["globalaveragepooling1d_1", 0, 0], ["globalmaxpooling1d_1", 0, 0]]], "name": "merge_7"}, {"class_name": "Merge", "config": {"name": "merge_9", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "sum", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["globalaveragepooling1d_2", 0, 0], ["globalmaxpooling1d_2", 0, 0]]], "name": "merge_9"}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_1", "epsilon": 1e-05, "trainable": true, "mode": 0, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_7", 0, 0]]], "name": "batchnormalization_1"}, {"class_name": "BatchNormalization", "config": {"name": "batchnormalization_2", "epsilon": 1e-05, "trainable": true, "mode": 0, "momentum": 0.99, "axis": -1}, "inbound_nodes": [[["merge_9", 0, 0]]], "name": "batchnormalization_2"}, {"class_name": "Merge", "config": {"name": "merge_10", "concat_axis": -1, "mode_type": "raw", "dot_axes": -1, "mode": "concat", "output_shape": null, "output_shape_type": "raw"}, "inbound_nodes": [[["batchnormalization_1", 0, 0], ["batchnormalization_2", 0, 0]]], "name": "merge_10"}, {"class_name": "Sequential", "config": [{"class_name": "Dropout", "config": {"p": 0.2, "batch_input_shape": [null, 200], "trainable": true, "name": "dropout_5", "input_dtype": "float32"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "entail1", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_3"}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "entail2", "activity_regularizer": null, "trainable": true, "init": "he_normal", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "linear", "output_dim": 100}}, {"class_name": "Activation", "config": {"activation": "relu", "trainable": true, "name": "activation_4"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "entail_out", "activity_regularizer": null, "trainable": true, "init": "zero", "bias": true, "input_dim": null, "b_regularizer": null, "W_regularizer": {"l2": 0.0, "name": "WeightRegularizer", "l1": 0.0}, "activation": "softmax", "output_dim": 3}}], "inbound_nodes": [[["merge_10", 0, 0]]], "name": "sequential_3"}], "input_layers": [["words1", 0, 0], ["words2", 0, 0]], "output_layers": [["sequential_3", 1, 0]], "name": "model_1"}}